const plants = [
  {
    id: 1,
    name: 'Classic ',
    price: 'Free',
    like: true,
    img: require('../assets/Gun_1.png'),
    about:
      'ปืนกระบอกเล็ก ๆ อย่าง Classic ก็มีข้อดีในการยิงศัตรูในระยะกลาง ผู้เล่นสามารถกระโดดและคลิกขวากระจายทีเดียว 3 นัดใส่ศัตรูตรงหน้าโดยที่กระสุนไม่เปลี่ยนทิศ แถมปืนกระบอกนี้ยังให้มาฟรีเมื่อเริ่มเกมอีกด้วย.',
  },

  {
    id: 2,
    name: 'Shorty',
    price: '200',
    like: false,
    img: require('../assets/Gun_2.png'),
    about:
      'ที่ถ้าหากจ๊ะเอ๋ศัตรูในระยะเผาขน ก็ลงไปนอนกันเลยทีเดียว แต่ไม่เหมาะกับการยิงระยะไกลเป็นอย่างยิ่งและอาจยิงไม่ต่อเนื่องเพราะหนึ่งแม็กซีนบรรจุกระสุนได้เพียง 2 นัดเท่านั้น โอกาสที่จะกำจัดศัตรูแบบต่อเนื่องก็น้อยลงเช่นกัน.',
  },
  {
    id: 3,
    name: 'Franzy',
    price: '400',
    like: false,
    img: require('../assets/Gun_3.png'),
    about:
      'กระบอกนี้โปรเพลเยอร์หลายคนเลือกที่จะหยิบ Franzy ในช่วง pistol round หรือรอบปืนพก สามารถกดค้างเพื่อสเปรย์ในระยะกลางได้อย่างดีเยี่ยม และหากเจอศัตรูในระยะประชิดถือว่า เป็นปืนที่ปลิดชีพศัตรูได้ว่องไวมาก.',
  },

  {
    id: 4,
    name: 'Ghost',
    price: '500',
    like: true,
    img: require('../assets/Gun_4.png'),
    about:
      ' ที่ถือว่าคุ้มค่ากับความแรง สามารถแท็ปศีรษะในระยะกลางแบบครั้งเดียวจอดในรอบปืนพก ถ้าหากอยู่ในระยะไกลต้องยิงศีรษะถึงสองครั้ง และไม่สามารถยิงสเปรย์ได้.',
  },
  {
    id: 5,
    name: 'Sheriff',
    price: '800',
    like: true,
    img: require('../assets/Gun_5.png'),
    about:
      'ซึ่งความรุนแรงใส่ศีรษะศัตรู 159-145 ใส่ลำตัว 55-50 ถ้ายิงถูกศีรษะนัดเดียวขึ้นสวรรค์ได้เลย แต่ด้วยแรงดีดของปืนอาจทำให้ผู้เล่นมือใหม่ควบคุมวิถีกระสุนยากพอสมควรแม้จะยืนอยู่กับที่ หากกดยิงรัว ๆ แรงดีดจะส่งผลทำให้กระสุนเปลี่ยนทิศทาง และความสามารถในการยิงทะลุกำแพงอยู่ในระดับที่สูงอีกด้วย.',
  },
  {
    id: 6,
    name: 'Stinger',
    price: '1,000',
    like: false,
    img: require('../assets/Gun_6.png'),
    about:
      'เป็นปืนที่ที่มีอัตรายิงเร็วที่สุดในปืนประเภท SMGS ใช้ยิงสเปรย์ปลิดชีพในระยะใกล้ได้ค่อนข้างดี แต่ในระยะกลางและระยะไกลไม่เหมาะกับปืนนี้อย่างยิ่ง ด้วยอัตรายิงที่เร็วมีผลทำให้ทิศทางของกระสุนกระจายตัวกว้างมาก อาจควมคุมไม่อยู่หากใช้การสเปรย์ ต้องใช้การเล็งผ่านศูนย์เล็ง ระบบปืนจะเปลี่ยนเป็นเซมิออโตเมติก ที่ต้องใช้การคลิกต่อเนื่อง การคลิกหนึ่งครั้งกระสุนออก 4 นัดก็สามารถยิงศัตรูในระยะไกลได้เช่นกัน.',
  },
  {
  id: 7,
  name: 'Specter',
  price: '1,600',
  like: false,
  img: require('../assets/Gun_7.png'),
  about:
    'เป็นปืนฟูลออโตเมติกที่เหมาะสมกับการสเปรย์ในระยะกลางได้ดีเยี่ยม ความสามารถในการวิ่งสาดกระสุนใส่ศีรษะศัตรูในระยะใกล้ได้ดีเยี่ยมเช่นเดียวกัน และยังทำดาเมจทะลุกำแพงในระดับกลาง ซึ่งทำได้ดีกว่า Stinger.',
  },
  {
    id: 8,
  name: 'Bucky',
  price: '900',
  like: false,
  img: require('../assets/Gun_8.png'),
  about:
    'Bucky ที่สามารถหยิบมาใช้ในรอบที่ต้องการประหยัดเครดิต ซึ่งพร้อมกับสกิลการคลิกขวาของปืน ที่ลดการกระจายตัวของกระสุนให้พุ่งออกไปเป็นกระจุกเดียวกันได้ในระยะไกล กระสุน 5 นัดต่อหนึ่งแม็กกาซีน ด้วยความล่าช้าในการซักเพื่อเปลี่ยนกระสุนหากยิงศัตรูพลาดในนัดแรก จึงอาจเกิดการเสียจังหวะขึ้นในนัดที่สองได้ ด้วยความรุนแรงในระยะใกล้ที่ปลิดชีพศัตรูได้เพียงคลิกเดียว ก็ต้องแลกมาด้วยความเบาบางในการหวังผลระยะไกลอย่างแน่นอน.',
  },
  {
    id: 9,
  name: 'Judge',
  price: '1,500',
  like: false,
  img: require('../assets/Gun_9.png'),
  about:
    'ซึ่งมีราคาสูงกว่า Bucky เท่าตัวแต่ด้วยอัตราความเร็วการยิงที่ปลิดชีพศัตรูได้ต่อเนื่อง ในระยะใกล้ หากศัตรูยืนรวมกลุ่มกัน อาจมีการ ACE เกิดขึ้นได้เลย แต่เช่นเคยด้วยความรุนแรงในระยะใกล้ที่ปลิดชีพศัตรูได้เพียงคลิกเดียว ก็ต้องแลกมาด้วยความเบาบางในการหวังผลระยะไกลเหมือน Bucky.',
  },
  {
    id: 10,
  name: 'Bulldog',
  price: '2,100',
  like: false,
  img: require('../assets/Gun_10.png'),
  about:
    'เป็นกระบอกที่ควบคุมวิถีกระสุนได้ไม่ยากนัก ทำดาเมจใส่ศีรษะศัตรูในระยะไกลถึง 0-50 เมตรก็ 115 ดาเมจเท่าเดิมแต่ต้องยิงถึงสองนัดจึงปลิดชีพศัตรูได้ ปืนนี้ก็มีโหมดเซมิออโตเมติกหรือสกิลพิเศษ เมื่อเล็งศูนย์กดคลิกซ้ายค้างกระสุนจะออกทีละ 3 นัด ซึ่งเหมาะสมกับผู้ที่ต้องการหวังผลในระยะไกลและยิงทะลุกำแพงในระดับกลาง ถือว่าคุ้มค่ากับเครดิตที่จ่ายไป.',
  },
  {
    id: 11,
  name: 'Guardian',
  price: '2,700',
  like: false,
  img: require('../assets/Gun_11.png'),
  about:
    'ปืนไรเฟิลกระบอกนี้เป็นปืนระบบเซมิออโตเมติก หากคลิกยิงรัว ๆ กระสุนจะกระเด็งขึ้นด้านบนในนัดที่ 1-4 และกระจายต่อเนื่องไปทางซ้ายและขวาในนัดที่ 5 แต่ถ้าค่อย ๆ คลิกช้าลง กระสุนจะตรงและนิ่งมาก ๆ เหมาะกับผู้เล่นที่ชอบแทปศีรษะ แบบ 1 Shot 1 Kill ในระยะไกล 0-50 เมตร ทำดาเมจใส่ศีรษะถึง 195 ดาเมจ หลับไม่ตื่นแน่นอน.',
  },
  {
    id: 12,
  name: 'Phantom',
  price: '2,900',
  like: false,
  img: require('../assets/Gun_12.png'),
  about:
    'เป็น Full auto 1 แม็กมี 30 นัด ระยะสโคบ 1.25 เท่า ความเร็วในการติดตั้ง 1 วินาที ความเร็วในการรีโหลด 2.5 วินาที ดาเมจของปืนนี้ จะมี 3 ระยะด้วยกัน 0-15 เมตร ศีรษะ 156 ลำตัว 39 ขา 33  ในระยะนี้ยิงโดนเพียงนัดเดียวก็ล้มพับได้เลย 15-30 เมตร ศีรษะ 140 ลำตัว 35 ขา 29  ในระยะนี้จะต้องยิงอย่างน้อย 2 นัด ถึงฆ่าศัตรูได้ 30-50 เมตร ศีรษะ 124 ลำตัว 31 ขา 26 ระยะจะต้องยิงอย่างน้อยละ 3 นัดขึ้นไป ศัตรูจึงจะล้ม.',
  },
  {
    id: 13,
  name: 'Vandal',
  price: '2,900',
  like: false,
  img: require('../assets/Gun_13.png'),
  about:
    'ปืนไรเฟิลฟูลออโตเมติก การทำดาเมจ ศีรษะ 160 ลำตัว 40 ขา 34 ไม่ว่าศัตรูจะอยู่ในระยะไหน หากยิงโดนหัวเพียงนัดเดียวก็ล้มลงไปนอนได้เลย การสเปรย์ กระสุนจะอยู่ในทางตรงจนถึงนัดที่ 4 หลังจากนี้หากต้องการสเปรย์ต่อจะต้องอาศัยการคุมปืนเพราะกระสุนชุดถัดไปจะมีความแม่นยำน้อยลงจากแรงดีดมหาศาล ข้อดีที่ทำให้ปืนนี้ได้รับความนิยมคือ ความสามารถในการปิดคิลได้เพียงนัดเดียวเท่านั้น แต่ต้องอาศัยความแม่นยำในนัดแรก ด้วยการวางเป้าที่ดี การ Flick shot หรือการสะบัดเม้าส์ ข้อแนะนำ Vandal เหมาะกับการเคาะหัวหรือยิงเป็นชุด มากกว่าการสเปรย์.',
  },
  {
    id: 14,
  name: 'Marshal',
  price: '1,100',
  like: false,
  img: require('../assets/Gun_14.png'),
  about:
    'ซื้อไว้ใช้งานในรอบประหยัดเครดิตถ้าหากผู้เล่นคนไหน มือนิ่ง ๆ เล็งแม่น ๆ แนะนำให้ซื้อมาปลิดชีพศัตรูแบบนัดเดียวจอดโดยการเล็งที่ศีรษะในระยะ 0-50 เมตรหรือถ้าศัตรูไม่มีเกาะในรอบประหยัดเครดิต ปืนกระบอกนี้ยิงที่ลำตัวก็เก็บคิลได้เช่นกัน.',
  },
  {
    id: 15,
  name: 'Operator',
  price: '4,500',
  like: false,
  img: require('../assets/Gun_15.png'),
  about:
    'ยิงถูกศีรษะและลำตัวในระยะ 0-50 เมตร ศัตรูไม่รอดอย่างแน่นอน Operator เป็นปืนที่ใช้ต้องเวลาเก็บเครดิตในแต่ละรอบ ให้เพียงพอ ซึ่งถ้าผู้เล่นที่ไม่มั่นในสมาธิขณะที่ซุ้มยิง ยังไม่แนะนำให้ซื้อ เพราะหากยิงพลาดในนัดแรก อาจถูกศัตรูปลิดชีพได้ทันทีศัตรูก็จะเก็บปืนของเราไปใช้งานแทน เพราะการรีโหลดกระสุนใหม่ที่ค่อยข้างช้า ซึ่งทำให้ศัตรูเกิดความได้เปรียบอย่างมาก แต่ผู้เล่นสามารถเลือกตำแหน่งที่ได้เปรียบและปลอดภัยเมื่อเลือก Operator มาใช้งาน ด้วยการยืนอยู่บนที่สูงหรือมีที่กำบัง และต้องมีเพื่อนในทีมหนึ่งคน คอยซัพพอร์ตอยู่ใกล้ ๆ แถมอีกหนึ่งข้อดีกับ Operator ด้วยลำกล้องที่สามารถเพิ่มระยะซูมได้สองระยะ ด้วยการคลิกขวาหนึ่งหรือสองครั้งที่ทำให้เห็นศัตรูในระยะไกลเกินกว่า 50 เมตรได้อย่างชัดเจนสุด ๆ .',
  },
  {
    id: 16,
  name: 'Ares',
  price: '1,700',
  like: false,
  img: require('../assets/Gun_16.png'),
  about:
    'ปืนกลหนักฟูลออโตเมติก 1 แม็กกาซีน มี 50 นัด ดาเมจมี 2 ระยะด้วยกัน 0-30 เมตร ศีรษะ 72 ลำตัว 30 ขา 25 30-50 เมตร ศีรษะ 67 ลำตัว 28 ขา 23 ดาเมจด้วยราคาที่แสนถูกจนสามารถซื้อได้ในทุก ๆ ราว แต่ดาเมจยิงทะลุกำแพงได้สบาย ๆ กระสุนลั่นไว ยิงแรง แต่แลกมาด้วยน้ำหนักที่มาก ทำให้เคลื่อนไหวช้ารีโหลดนาน ทำให้ไม่เหมาะกับบางเอเจนท์ เช่น JETT OMEN เป็นต้น ในการสเปรย์กระสุนจะนิ่งสุดใน 20 นัดแรก การสโคบจะช่วยให้กระสุนเป็นกระจุกมากขึ้น ควบควบคุมได้ง่ายขึ้น จึงแนะนำให้สโคบในการใช้ปืนนี้.',
  },
  {
    id: 17,
  name: 'Odin',
  price: '3,200',
  like: false,
  img: require('../assets/Gun_17.png'),
  about:
    'ปืนกลหนักฟูลออโตเมติก ที่ฉีกกฎปืนทุก ๆ กระบอก ทั้งกระสุนที่เยอะ การรัวกระสุนสุดจะมันส์ ถึงแม้ดาเมจต่อนัด จะไม่ถึงขั้นปลิดชีพศัตรูเลยทันที แต่ความเร็วการลั่นกระสุนที่รวดเร็ว คลิกครั้งเดียวกระสุนออก 4-5 นัด แค่นี้ศัตรูก็ไม่รอด และยังสามารถกดยิงสเปรย์คค้างไว้เป็นระยะเวลานาน ๆ จนกว่าจะหมด 100 นัด เป็นปืนที่เหมาะกับการสเปรย์ไปยังจุดที่ถูก ปิดกั้นด้วยสโม๊ค หรือทำดาเมจทะลุกำแพงยืนเป็นหน่วงป้องกันให้เพื่อนร่วมทีมในแนวหลังได้เป็นอย่างดีอีกด้วย.',
  },
];

export default plants;
